# Задание 16 (№581) .
# Алгоритм вычислений функции F (n) задан эти соотношения:
# F (n) = 1, при n <-100000,
# F (n) = F (n - 1) + 3 * F (n - 3) + 2, при n> 10,
# F (n) = -F (n - 1) для остальных случаев.
# Чему равно значение функции F (20)?

from functools import lru_cache
@lru_cache()
def f(n):
    if n <-100000:
        return 1
    elif n>10:
        return f(n-1)+3*f(n-3)+2
    else:
        return -f(n-1)
    
# Занесем в кэш все занчения n от -100000 до 20
for i in range (-100000,20+1):
    f(i)

print(f(20))